2023/ycsb/mongodb/dbaas-navigator_ycsb_mongodb-documentdb-aws_0_HH4cPMa0/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-02e5e2be-108c-5f25-935a-9257cacea840.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-02e5e2be-108c-5f25-935a-9257cacea840.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://root:pCm9YZpSAres@dbaas-navigator-02e5e2be-108c-5f25-935a-9257cacea840.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin -p batchsize=100 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=10000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-01-09 11:05:12:356 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://root:pCm9YZpSAres@dbaas-navigator-02e5e2be-108c-5f25-935a-9257cacea840.cluster-cdwm6pzxjgvr.us-west-2.docdb.amazonaws.com:27017/admin
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2023-01-09 11:05:22:339 10 sec: 173900 operations; 17390 current ops/sec; est completion in 9 minutes [INSERT: Count=173900, Max=2541567, Min=6, Avg=5243.84, 90=15, 99=6791, 99.9=1099775, 99.99=1748991] 
2023-01-09 11:05:32:339 20 sec: 357700 operations; 18380 current ops/sec; est completion in 9 minutes [INSERT: Count=183800, Max=2377727, Min=6, Avg=5479.57, 90=10, 99=17503, 99.9=1078271, 99.99=1641471] 
2023-01-09 11:05:42:339 30 sec: 540000 operations; 18230 current ops/sec; est completion in 8 minutes [INSERT: Count=182300, Max=2256895, Min=6, Avg=5480.19, 90=11, 99=11415, 99.9=1126399, 99.99=1631231] 
2023-01-09 11:05:52:339 40 sec: 723000 operations; 18300 current ops/sec; est completion in 8 minutes [INSERT: Count=183000, Max=2036735, Min=6, Avg=5457.32, 90=10, 99=11375, 99.9=1094655, 99.99=1583103] 
2023-01-09 11:06:02:339 50 sec: 906004 operations; 18300.4 current ops/sec; est completion in 8 minutes [INSERT: Count=183084, Max=2131967, Min=6, Avg=5469.43, 90=12, 99=20015, 99.9=1123327, 99.99=1632255] 
2023-01-09 11:06:12:339 60 sec: 1088500 operations; 18249.6 current ops/sec; est completion in 8 minutes [INSERT: Count=182416, Max=2053119, Min=6, Avg=5443.84, 90=10, 99=19295, 99.9=1110015, 99.99=1652735] 
2023-01-09 11:06:22:339 70 sec: 1272800 operations; 18430 current ops/sec; est completion in 8 minutes [INSERT: Count=184300, Max=2402303, Min=6, Avg=5447.45, 90=12, 99=5867, 99.9=1074175, 99.99=1611775] 
2023-01-09 11:06:32:339 80 sec: 1456200 operations; 18340 current ops/sec; est completion in 7 minutes [INSERT: Count=183400, Max=2189311, Min=6, Avg=5488.16, 90=9, 99=17663, 99.9=1134591, 99.99=1767423] 
2023-01-09 11:06:42:339 90 sec: 1640200 operations; 18400 current ops/sec; est completion in 7 minutes [INSERT: Count=184000, Max=2127871, Min=6, Avg=5423.3, 90=11, 99=19743, 99.9=1104895, 99.99=1668095] 
2023-01-09 11:06:52:339 100 sec: 1823500 operations; 18330 current ops/sec; est completion in 7 minutes [INSERT: Count=183300, Max=2377727, Min=6, Avg=5433.16, 90=10, 99=6479, 99.9=1060863, 99.99=1613823] 
2023-01-09 11:07:02:339 110 sec: 2007800 operations; 18430 current ops/sec; est completion in 7 minutes [INSERT: Count=184300, Max=2547711, Min=6, Avg=5409.98, 90=10, 99=18527, 99.9=1113087, 99.99=1608703] 
2023-01-09 11:07:12:339 120 sec: 2191400 operations; 18360 current ops/sec; est completion in 7 minutes [INSERT: Count=183600, Max=2077695, Min=6, Avg=5460.71, 90=11, 99=19087, 99.9=1089535, 99.99=1666047] 
2023-01-09 11:07:22:339 130 sec: 2375354 operations; 18395.4 current ops/sec; est completion in 6 minutes [INSERT: Count=183999, Max=2260991, Min=6, Avg=5438.28, 90=10, 99=20063, 99.9=1105919, 99.99=1652735] 
2023-01-09 11:07:32:339 140 sec: 2560800 operations; 18544.6 current ops/sec; est completion in 6 minutes [INSERT: Count=185401, Max=2034687, Min=6, Avg=5384.39, 90=9, 99=19935, 99.9=1050623, 99.99=1563647] 
2023-01-09 11:07:42:339 150 sec: 2743400 operations; 18260 current ops/sec; est completion in 6 minutes [INSERT: Count=182600, Max=2021375, Min=6, Avg=5464.65, 90=10, 99=19359, 99.9=1090559, 99.99=1629183] 
2023-01-09 11:07:52:339 160 sec: 2929600 operations; 18620 current ops/sec; est completion in 6 minutes [INSERT: Count=186200, Max=2109439, Min=6, Avg=5401.11, 90=11, 99=17887, 99.9=1046015, 99.99=1588223] 
2023-01-09 11:08:02:342 170 sec: 3114040 operations; 18436.63 current ops/sec; est completion in 6 minutes [INSERT: Count=184484, Max=2101247, Min=6, Avg=5421.6, 90=10, 99=20319, 99.9=1075199, 99.99=1574911] 
2023-01-09 11:08:12:339 180 sec: 3297400 operations; 18343.34 current ops/sec; est completion in 6 minutes [INSERT: Count=183316, Max=2105343, Min=6, Avg=5430.92, 90=9, 99=19839, 99.9=1096703, 99.99=1631231] 
2023-01-09 11:08:22:339 190 sec: 3482100 operations; 18470 current ops/sec; est completion in 5 minutes [INSERT: Count=184700, Max=2105343, Min=6, Avg=5419.87, 90=9, 99=21087, 99.9=1107967, 99.99=1670143] 
2023-01-09 11:08:32:339 200 sec: 3667800 operations; 18570 current ops/sec; est completion in 5 minutes [INSERT: Count=185700, Max=2123775, Min=6, Avg=5394.11, 90=9, 99=7575, 99.9=1058815, 99.99=1611775] 
2023-01-09 11:08:42:339 210 sec: 3851800 operations; 18400 current ops/sec; est completion in 5 minutes [INSERT: Count=184000, Max=2181119, Min=6, Avg=5407.4, 90=10, 99=19583, 99.9=1094655, 99.99=1604607] 
2023-01-09 11:08:52:339 220 sec: 4037400 operations; 18560 current ops/sec; est completion in 5 minutes [INSERT: Count=185600, Max=2301951, Min=6, Avg=5399.72, 90=11, 99=19231, 99.9=1071103, 99.99=1637375] 
2023-01-09 11:09:02:339 230 sec: 4223800 operations; 18640 current ops/sec; est completion in 5 minutes [INSERT: Count=186400, Max=2385919, Min=6, Avg=5367.67, 90=10, 99=20287, 99.9=1071103, 99.99=1606655] 
2023-01-09 11:09:12:339 240 sec: 4409821 operations; 18602.1 current ops/sec; est completion in 5 minutes [INSERT: Count=186064, Max=2195455, Min=6, Avg=5395.17, 90=9, 99=18207, 99.9=1104895, 99.99=1514495] 
2023-01-09 11:09:22:339 250 sec: 4595200 operations; 18537.9 current ops/sec; est completion in 4 minutes [INSERT: Count=185341, Max=2134015, Min=6, Avg=5337.63, 90=10, 99=20895, 99.9=1089535, 99.99=1603583] 
2023-01-09 11:09:32:339 260 sec: 4781300 operations; 18610 current ops/sec; est completion in 4 minutes [INSERT: Count=186095, Max=2361343, Min=6, Avg=5436.34, 90=11, 99=6023, 99.9=1090559, 99.99=1672191] 
2023-01-09 11:09:42:339 270 sec: 4966600 operations; 18530 current ops/sec; est completion in 4 minutes [INSERT: Count=185300, Max=2089983, Min=6, Avg=5390.73, 90=11, 99=20687, 99.9=1070079, 99.99=1675263] 
2023-01-09 11:09:52:339 280 sec: 5150900 operations; 18430 current ops/sec; est completion in 4 minutes [INSERT: Count=184300, Max=2160639, Min=6, Avg=5367.35, 90=10, 99=19807, 99.9=1079295, 99.99=1724415] 
2023-01-09 11:10:02:339 290 sec: 5337700 operations; 18680 current ops/sec; est completion in 4 minutes [INSERT: Count=186800, Max=2281471, Min=6, Avg=5382.28, 90=10, 99=19695, 99.9=1077247, 99.99=1600511] 
2023-01-09 11:10:12:339 300 sec: 5490200 operations; 15250 current ops/sec; est completion in 4 minutes [INSERT: Count=152500, Max=3319807, Min=6, Avg=6539.04, 90=12, 99=18399, 99.9=1341439, 99.99=2846719] 
2023-01-09 11:10:22:339 310 sec: 5674700 operations; 18450 current ops/sec; est completion in 3 minutes [INSERT: Count=184500, Max=2224127, Min=6, Avg=5396.72, 90=11, 99=20655, 99.9=1094655, 99.99=1708031] 
2023-01-09 11:10:32:339 320 sec: 5858900 operations; 18420 current ops/sec; est completion in 3 minutes [INSERT: Count=184200, Max=2140159, Min=6, Avg=5468.28, 90=10, 99=19471, 99.9=1135615, 99.99=1776639] 
2023-01-09 11:10:42:339 330 sec: 6040900 operations; 18200 current ops/sec; est completion in 3 minutes [INSERT: Count=182000, Max=2131967, Min=6, Avg=5486.82, 90=9, 99=18735, 99.9=1096703, 99.99=1651711] 
2023-01-09 11:10:52:339 340 sec: 6224800 operations; 18390 current ops/sec; est completion in 3 minutes [INSERT: Count=183900, Max=2121727, Min=6, Avg=5433.96, 90=9, 99=17615, 99.9=1067007, 99.99=1654783] 
2023-01-09 11:11:02:339 350 sec: 6408500 operations; 18370 current ops/sec; est completion in 3 minutes [INSERT: Count=183700, Max=2013183, Min=6, Avg=5441.96, 90=9, 99=6483, 99.9=1081343, 99.99=1594367] 
2023-01-09 11:11:12:339 360 sec: 6592100 operations; 18360 current ops/sec; est completion in 3 minutes [INSERT: Count=183600, Max=2252799, Min=6, Avg=5443.62, 90=8, 99=18959, 99.9=1078271, 99.99=1711103] 
2023-01-09 11:11:22:339 370 sec: 6777200 operations; 18510 current ops/sec; est completion in 2 minutes [INSERT: Count=185100, Max=2119679, Min=6, Avg=5403.89, 90=10, 99=20831, 99.9=1068031, 99.99=1634303] 
2023-01-09 11:11:32:339 380 sec: 6961400 operations; 18420 current ops/sec; est completion in 2 minutes [INSERT: Count=184200, Max=2308095, Min=6, Avg=5415.02, 90=10, 99=19695, 99.9=1104895, 99.99=1737727] 
2023-01-09 11:11:42:339 390 sec: 7144000 operations; 18260 current ops/sec; est completion in 2 minutes [INSERT: Count=182600, Max=2330623, Min=6, Avg=5494.02, 90=12, 99=19359, 99.9=1114111, 99.99=1722367] 
2023-01-09 11:11:52:339 400 sec: 7325700 operations; 18170 current ops/sec; est completion in 2 minutes [INSERT: Count=181700, Max=2129919, Min=6, Avg=5468.93, 90=8, 99=17567, 99.9=1153023, 99.99=1705983] 
2023-01-09 11:12:02:339 410 sec: 7508500 operations; 18280 current ops/sec; est completion in 2 minutes [INSERT: Count=182800, Max=2437119, Min=6, Avg=5478.52, 90=10, 99=20527, 99.9=1089535, 99.99=1726463] 
2023-01-09 11:12:12:339 420 sec: 7691600 operations; 18310 current ops/sec; est completion in 2 minutes [INSERT: Count=183100, Max=2295807, Min=6, Avg=5462.32, 90=9, 99=20159, 99.9=1087487, 99.99=1658879] 
2023-01-09 11:12:22:339 430 sec: 7876300 operations; 18470 current ops/sec; est completion in 1 minute [INSERT: Count=184700, Max=2073599, Min=6, Avg=5406.5, 90=12, 99=20655, 99.9=1065983, 99.99=1589247] 
2023-01-09 11:12:32:339 440 sec: 8059500 operations; 18320 current ops/sec; est completion in 1 minute [INSERT: Count=183200, Max=2138111, Min=6, Avg=5459.31, 90=11, 99=19135, 99.9=1098751, 99.99=1614847] 
2023-01-09 11:12:42:339 450 sec: 8242088 operations; 18258.8 current ops/sec; est completion in 1 minute [INSERT: Count=182600, Max=1933311, Min=6, Avg=5480.98, 90=11, 99=19935, 99.9=1124351, 99.99=1687551] 
2023-01-09 11:12:52:339 460 sec: 8423400 operations; 18131.2 current ops/sec; est completion in 1 minute [INSERT: Count=181300, Max=2349055, Min=6, Avg=5543.98, 90=10, 99=17871, 99.9=1124351, 99.99=1698815] 
2023-01-09 11:13:02:339 470 sec: 8605388 operations; 18198.8 current ops/sec; est completion in 1 minute [INSERT: Count=182000, Max=2131967, Min=6, Avg=5464.82, 90=11, 99=19551, 99.9=1128447, 99.99=1691647] 
2023-01-09 11:13:12:339 480 sec: 8790100 operations; 18471.2 current ops/sec; est completion in 1 minute [INSERT: Count=184700, Max=2099199, Min=6, Avg=5430.73, 90=10, 99=20271, 99.9=1104895, 99.99=1610751] 
2023-01-09 11:13:22:339 490 sec: 8974500 operations; 18440 current ops/sec; est completion in 56 seconds [INSERT: Count=184400, Max=2295807, Min=6, Avg=5421.16, 90=10, 99=20159, 99.9=1095679, 99.99=1673215] 
2023-01-09 11:13:32:339 500 sec: 9159300 operations; 18480 current ops/sec; est completion in 46 seconds [INSERT: Count=184800, Max=2279423, Min=6, Avg=5379.91, 90=10, 99=22559, 99.9=1089535, 99.99=1637375] 
2023-01-09 11:13:42:339 510 sec: 9341900 operations; 18260 current ops/sec; est completion in 36 seconds [INSERT: Count=182600, Max=2174975, Min=6, Avg=5494, 90=10, 99=5847, 99.9=1121279, 99.99=1718271] 
2023-01-09 11:13:52:339 520 sec: 9524000 operations; 18210 current ops/sec; est completion in 26 seconds [INSERT: Count=182100, Max=2174975, Min=6, Avg=5485.49, 90=10, 99=19647, 99.9=1099775, 99.99=1696767] 
2023-01-09 11:14:02:339 530 sec: 9705908 operations; 18190.8 current ops/sec; est completion in 17 seconds [CLEANUP: Count=8, Max=6, Min=1, Avg=1.75, 90=2, 99=6, 99.9=6, 99.99=6] [INSERT: Count=181908, Max=2215935, Min=6, Avg=5415.64, 90=10, 99=23151, 99.9=1064959, 99.99=1708031] 
2023-01-09 11:14:12:339 540 sec: 9886242 operations; 18033.4 current ops/sec; est completion in 7 second [CLEANUP: Count=34, Max=2, Min=1, Avg=1.03, 90=1, 99=2, 99.9=2, 99.99=2] [INSERT: Count=180334, Max=1826815, Min=6, Avg=4521.12, 90=9, 99=25567, 99.9=915967, 99.99=1534975] 
2023-01-09 11:14:18:964 546 sec: 10000000 operations; 17168.43 current ops/sec; [CLEANUP: Count=58, Max=5063, Min=0, Avg=88.26, 90=1, 99=2, 99.9=5063, 99.99=5063] [INSERT: Count=113758, Max=1052671, Min=6, Avg=2005.88, 90=11, 99=28175, 99.9=430079, 99.99=706047] 
[OVERALL], RunTime(ms), 546625
[OVERALL], Throughput(ops/sec), 18294.077292476562
[TOTAL_GCS_PS_Scavenge], Count, 739
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3777
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6909672993368396
[TOTAL_GCS_PS_MarkSweep], Count, 53
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 1278
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.23379830779785044
[TOTAL_GCs], Count, 792
[TOTAL_GC_TIME], Time(ms), 5055
[TOTAL_GC_TIME_%], Time(%), 0.9247656071346902
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 51.68
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 5063
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 6
[INSERT], Operations, 10000000
[INSERT], AverageLatency(us), 5393.2459717
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 3319807
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 19167
[INSERT], Return=OK, 100000
[INSERT], Return=BATCHED_OK, 9900000